// From MacBuddy
// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "好";
"CANCEL_BUTTON"		= "取消";
"GOBACK_BUTTON"		= "返回";
"DIAGNOSE_BUTTON"	= "診斷";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "正在設定您的電腦⋯";
"MESSAGE_PREP_CONNECTION"	= "正在準備連線⋯";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "無法預期的錯誤";
"MESSAGE_FATAL_ERROR_TITLE"		= "抱歉，發生無法預期的錯誤。";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "錯誤";
"ERROR_MESSAGE_GENERIC_TITLE"			= "抱歉⋯";


// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "抱歉";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "警告";
"ERROR_MESSAGE_VALIDATION_WARNING" = "是否要繼續？";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "您尚未提供所有必要的資料。";
"ERROR_MESSAGE_VALIDATION_0001" = "請檢查以紅色箭頭標示的欄位並輸入所要求的資訊。";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "您輸入的文字太短。";
"ERROR_MESSAGE_VALIDATION_0002" = "請檢查特別標明的欄位，並更正輸入的文字。";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "您輸入的資料錯誤。";

                    // NI Username invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "您輸入的使用者名稱無效。";
"ERROR_MESSAGE_VALIDATION_0004" = "請檢查特別標明的欄位，並為 NetInfo 網路輸入有效的使用者名稱。";

                    // NI Password invalid
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "您輸入的密碼不正確。";
"ERROR_MESSAGE_VALIDATION_0005" = "請檢查特別標明的欄位，並輸入正確的密碼。";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "您輸入的使用者名稱無法使用。";
"ERROR_MESSAGE_VALIDATION_0006" = "請檢查特別標明的欄位，並選擇不同的簡稱。";
"ERROR_MESSAGE_VALIDATION_0007" = "名為該簡稱的使用者已經存在。請輸入不同的簡稱。";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "您輸入的 IP 位址是空的。";
"ERROR_MESSAGE_VALIDATION_0010" = "您輸入的 IP 位址包含無效字元。";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "位址必須包含 4 個區段。"; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "請檢查特別標明的欄位，並輸入有效的位址。若您不知道此項資料，請詢問您的網路管理者。";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "位址必須包含 4 個區段。"; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "請檢查特別標明的欄位，並輸入有效的位址。若您不知道此項資料，請詢問您的網路管理者。";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "每個位址區段必須包含 1 個至 3 個字元。"; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "請檢查特別標明的欄位，並輸入有效的位址。若您不知道此項資料，請詢問您的網路管理者。";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "您輸入的位址是不被允許使用的。";
"ERROR_MESSAGE_VALIDATION_0014" = "請檢查特別標明的欄位，並輸入有效的位址。若您不知道此項資料，請詢問您的網路管理者。";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "您輸入的子網路遮罩無效。";
"ERROR_MESSAGE_VALIDATION_0015" = "請檢查特別標明的欄位，並輸入有效的子網路遮罩。若您不知道此項資料，請詢問您的網路管理者。";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "您輸入的名稱在 NetInfo 網路上已經存在。您將無法使用此名稱登入 NetInfo。";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "不能使用同一數值。";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "您輸入的密碼無效。";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "您所輸入的信用卡號碼無法使用。";
"ERROR_MESSAGE_VALIDATION_0019" = "請檢查特別標明的欄位，並輸入有效的信用卡號碼。";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "您的帳號名稱不能以數字為首。";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "您所輸入的電子郵件位址可能無法使用。";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "IP 位址和路由器位址與您輸入的子網路遮罩不相容。請檢查下列欄位，並輸入有效的數值：\n      IP 位址\n      子網路遮罩\n      路由器位址\n若不清楚這些資訊，請詢問您的網路管理者。";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "您輸入的使用者名稱無法使用。";
"ERROR_MESSAGE_VALIDATION_0023" = "請檢查反白的欄位並選擇其他名稱。";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "這些是相同的項目。";
"ERROR_MESSAGE_VALIDATION_0024" = "請檢查特別標明的欄位並輸入專用的數值。";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_NO_DIAL_TONE_TITLE"			= "您的數據機無法偵測到撥號音。";
"MESSAGE_NO_DIAL_TONE"					= "請確定您的數據機已連上電腦，然後按“好”一下，或按“取消”一下返回，並勾選“忽略撥號音”註記框。";

// ========== Network Setup Assistant addition ==========
"QUIT_BUTTON"		= "結束";
                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "密碼不符。";
"ERROR_PASSWORD_DO_NOT_MATCH" = "請檢查以紅色箭頭標記的欄位，並在兩個欄位中輸入相同的密碼。";

"ERROR_MUST_ENTER_LOCATION_NAME_TITLE" = "請輸入所在位置名稱。";
"ERROR_MUST_ENTER_LOCATION_NAME" = "您正在為儲存這些設定建立一個新的網路所在位置。您現在必須輸入一個所在位置名稱。";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME_TITLE" = "請輸入不同的所在位置名稱。";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME" = "您輸入的所在位置名稱已經存在。請輸入不同的名稱。";


"MESSAGE_TASK_FORMAT" = "“%1$@ 連線經由 %2$@”"; // %1$@ = CONNECTION, %2$@ = CONFIGURATION
"CONNECTION_Wireless" = "無線";
"CONNECTION_Modem" = "數據機";
"CONNECTION_DSL" = "DSL";
"CONNECTION_CableModem" = "纜線數據機";
"CONNECTION_Lan" = "區域網路";
"CONFIGURE_PPP" = "PPP";
"CONFIGURE_DHCP" = "DHCP";
"CONFIGURE_DHCPClientID" = "DHCP 與用戶識別碼";
"CONFIGURE_PPPoE" = "PPPoE";
"CONFIGURE_Manual" = "靜態 IP";

"MESSAGE_TITLE_CONFIGURE" = "正在設定⋯";
"MESSAGE_FAILED_CONFIGURE" = "設定失敗。";
"MESSAGE_DONE_CONFIGURE" = "完成設定。";
"MESSAGE_CHECKING_CONNECTION" = "正在檢查您的網路連線⋯";
"MESSAGE_CONNECTED" = "已建立網路連線。";
"MESSAGE_NOT_CONNECTED" = "無法建立網路連線。";
"MESSAGE_NOT_CONNECTED_TRY_AGAIN" = "您的電腦無法連接 Internet。請按“好”一下返回以更改您的網路設定，然後再試一次。";

"DEFAULT_LOCATION_NAME" = "所在位置（%@）";
"DUPLICATE_LOCATION_NAME" = "%1$@ %2$d";